IdeaRS.Connections
BasePlateData Properties
Compatible with IDEA StatiCa 0.0
The BasePlateData type exposes the following members.
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
BasePlateContact
ColumnPath
 Gets or sets the column
CoordSystem
 Coordinate system can be taken from column or can be global
Fastening
 Gets or sets the properties of the anchoring
FlangesWeld
 Gets or sets the properties of the weld - flanges
FoundationBlockHeight
 Gets or sets the value of the offset of the foundation block from the base plate. The value is used for the check of the concrete cone failure.
FoundationBlockOffset
 Gets or sets the value of the offset of the foundation block from the base plate. The value is used for the check of the concrete cone failure.
InnerRadius
 Gets or sets the inner radius of the circular plate boundary.
IsActive |  (Inherited from ConnectionCmdData.)
IsWeld
 If true welds are generated automatically
MatConcreteName
 Gets or sets the name of concrete in the foundation.
MortarJoint
 Influence of mortar joint
MortarJointThickness
 Mortar thickness
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OffsetBottom
 Gets or sets the bottom offset of the base plate boundary in the horizontal direction (the width of the plate). The size of the base plate is based on the circumscribed box of the column.
OffsetLeft
 Gets or sets the left offset of the base plate boundary in the vertical direction (the height of the plate). The size of the base plate is based on the circumscribed box of the column.
OffsetRight
 Gets or sets the right offset of the base plate boundary in the vertical direction (the height of the plate). The size of the base plate is based on the circumscribed box of the column.
OffsetTop
 Gets or sets the top offset of the base plate boundary in the horizontal direction (the width of the plate). The size of the base plate is based on the circumscribed box of the column.
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
Orientation
 Gets or sets the orientation of the base plate relative to its connected member
OuterRadius
 Gets or sets the outer radius of the circular plate boundary.
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PlateSizeMethod
 Gets or sets the method of the definition of dimensions of the plate
RotationOnZ
 Rotation of the baseplate on axis Z
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
ShearForceTransfer
 Gets or sets the method of transfer of shear force to a foundation block
ShearIronCssName
 Gets or sets the identifier of the cross-section of the shear iron
ShearIronLength
 Gets or sets the length of the shear iron
ShearIronPosition
 Gets or sets the position of the shear iron
ShearIronRotation
 Gets or sets the rotation of the shear iron
ShearLugFlangesWeld
 Gets or sets the properties of the weld between the base plate and shear lug
ShearLugWebsWeld
 Gets or sets the properties of the weld between the base plate and shear lug
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Weld
 Gets or sets the properties of the weld - other parts
Top
See Also
Reference
BasePlateData Class
IdeaRS.Connections.Data Namespace